In [1]:
%autosave 0

Autosave disabled

In [1]:
import pandas as pd
import numpy as np

from sklearn.linear_model import LogisticRegression
from adam_prepare import titanic_pipeline

Let's read in the data using the titanic pipeline function!

In [2]:
train, val, test = titanic_pipeline()
train.head()

,survived,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,0,19.0,1,0,53.1000,0,True,True,False,False,False,False,True
45,0,29.0,0,0,8.0500,1,True,False,False,True,False,False,True
28,1,29.0,0,0,7.8792,1,False,False,False,True,False,True,False
633,0,29.0,0,0,0.0000,1,True,True,False,False,False,False,True
403,0,28.0,1,0,15.8500,0,True,False,False,True,False,False,True

Let's define a function to create X and y splits of our data.

In [3]:
def xy_split(df):
    
    return df.drop(columns = ['survived']), df.survived

In [16]:
X_train, y_train = xy_split(train)
X_val, y_val = xy_split(val)

X_train.head()

,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,19.0,1,0,53.1000,0,True,True,False,False,False,False,True
45,29.0,0,0,8.0500,1,True,False,False,True,False,False,True
28,29.0,0,0,7.8792,1,False,False,False,True,False,True,False
633,29.0,0,0,0.0000,1,True,True,False,False,False,False,True
403,28.0,1,0,15.8500,0,True,False,False,True,False,False,True

Now it's time to build our [LogisticRegression](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.LogisticRegression.html) model!

In [17]:
seed = 42

logreg = LogisticRegression(random_state = seed, max_iter = 400)

logreg.fit(X_train, y_train)

logreg.score(X_train, y_train), logreg.score(X_val, y_val)

(0.7993579454253612, 0.8507462686567164)

In [18]:
logreg.coef_

array([[-0.04131956, -0.49520052, -0.17900688,  0.00252894, -0.62470577,
        -2.47895528,  0.98241479,  0.0508135 , -1.01420055, -0.14031909,
         0.22561708, -0.41096248]])

In [19]:
pd.DataFrame({'feature': X_train.columns,
              'coefficient': logreg.coef_[0]})

                    feature  coefficient
0                       age    -0.041320
1                     sibsp    -0.495201
2                     parch    -0.179007
3                      fare     0.002529
4                     alone    -0.624706
5                  sex_male    -2.478955
6               class_First     0.982415
7              class_Second     0.050813
8               class_Third    -1.014201
9     embark_town_Cherbourg    -0.140319
10   embark_town_Queenstown     0.225617
11  embark_town_Southampton    -0.410962

In [20]:
# xtremme

In [24]:

seed = 42
logreg = LogisticRegression(random_state = seed, max_iter=400,
                            solver = 'liblinear', penalty = '11')
#logreg.fit(X_train, y_train)
#logreg.score(X_train, y_train), logreg.score(X_val, y_val)

In [ ]:
pd.DataFrame({'feature': X_train.columns,
              'coefficient': logreg.coef_[0]})